#include<stdio.h>        
void main()                            
{                                 

int a, b, c,d;	
int n = 0;

for(a=0;a<=100;a++)
{
	for(b=0;b<=50;b++)
	{
      for(c=0;c<=20;c++)
	  {
		 for(d=0;d<=10;d++)
		 {
			if((1*a+2*b+5*c+10*d == 100)&&(a+b+c+d==40))
			{
				n++;
				printf("第%d种组合:%d张一元,%d张二元, %d张五元, %d张十元。\n",n,a, b, c, d);
			}
			
		 }
	  }

	}
}
printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>一共%d种组合<<<<<<<<<<<<<<<<<<<<<<<<<<<\n",n);

}
/*
第1种组合:0张一元,35张二元, 4张五元, 1张十元。
第2种组合:1张一元,32张二元, 7张五元, 0张十元。
第3种组合:2张一元,34张二元, 2张五元, 2张十元。
第4种组合:3张一元,31张二元, 5张五元, 1张十元。
第5种组合:4张一元,28张二元, 8张五元, 0张十元。
第6种组合:4张一元,33张二元, 0张五元, 3张十元。
第7种组合:5张一元,30张二元, 3张五元, 2张十元。
第8种组合:6张一元,27张二元, 6张五元, 1张十元。
第9种组合:7张一元,24张二元, 9张五元, 0张十元。
第10种组合:7张一元,29张二元, 1张五元, 3张十元。
第11种组合:8张一元,26张二元, 4张五元, 2张十元。
第12种组合:9张一元,23张二元, 7张五元, 1张十元。
第13种组合:10张一元,20张二元, 10张五元, 0张十元。
第14种组合:10张一元,25张二元, 2张五元, 3张十元。
第15种组合:11张一元,22张二元, 5张五元, 2张十元。
第16种组合:12张一元,19张二元, 8张五元, 1张十元。
第17种组合:12张一元,24张二元, 0张五元, 4张十元。
第18种组合:13张一元,16张二元, 11张五元, 0张十元。
第19种组合:13张一元,21张二元, 3张五元, 3张十元。
第20种组合:14张一元,18张二元, 6张五元, 2张十元。
第21种组合:15张一元,15张二元, 9张五元, 1张十元。
第22种组合:15张一元,20张二元, 1张五元, 4张十元。
第23种组合:16张一元,12张二元, 12张五元, 0张十元。
第24种组合:16张一元,17张二元, 4张五元, 3张十元。
第25种组合:17张一元,14张二元, 7张五元, 2张十元。
第26种组合:18张一元,11张二元, 10张五元, 1张十元。
第27种组合:18张一元,16张二元, 2张五元, 4张十元。
第28种组合:19张一元,8张二元, 13张五元, 0张十元。
第29种组合:19张一元,13张二元, 5张五元, 3张十元。
第30种组合:20张一元,10张二元, 8张五元, 2张十元。
第31种组合:20张一元,15张二元, 0张五元, 5张十元。
第32种组合:21张一元,7张二元, 11张五元, 1张十元。
第33种组合:21张一元,12张二元, 3张五元, 4张十元。
第34种组合:22张一元,4张二元, 14张五元, 0张十元。
第35种组合:22张一元,9张二元, 6张五元, 3张十元。
第36种组合:23张一元,6张二元, 9张五元, 2张十元。
第37种组合:23张一元,11张二元, 1张五元, 5张十元。
第38种组合:24张一元,3张二元, 12张五元, 1张十元。
第39种组合:24张一元,8张二元, 4张五元, 4张十元。
第40种组合:25张一元,0张二元, 15张五元, 0张十元。
第41种组合:25张一元,5张二元, 7张五元, 3张十元。
第42种组合:26张一元,2张二元, 10张五元, 2张十元。
第43种组合:26张一元,7张二元, 2张五元, 5张十元。
第44种组合:27张一元,4张二元, 5张五元, 4张十元。
第45种组合:28张一元,1张二元, 8张五元, 3张十元。
第46种组合:28张一元,6张二元, 0张五元, 6张十元。
第47种组合:29张一元,3张二元, 3张五元, 5张十元。
第48种组合:30张一元,0张二元, 6张五元, 4张十元。
第49种组合:31张一元,2张二元, 1张五元, 6张十元。

>>>>>>>>>>>>>>>>>>>>>>>>>一共49种组合<<<<<<<<<<<<<<<<<<<<<<<<<<<
Press any key to continue
*/